app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "hi"], ["created_at", "2021-09-27 18:21:27.924055"], ["updated_at", "2021-09-27 18:21:27.924055"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save